LakshayNegi108/STM32F070RB_BARE_METAL_LIB/SPFD5408 driver for STM32F0/tft_lib/Src/st7783.c
/*
 * STM7783.c
 *
 * Created: Mar 15, 2015
 * 
 * Grafic LCD Function (Chip=ST7783)
 *
 * This code has been taken from the Adafruit TFT Library and modified
 * for use with TFT Shields / Modules
 * For original code / licensing please refer to
 * https://github.com/adafruit/TFTLCD-Library
 *
 * This code has been taken from Smoke And Wires
 * for use with TFT Shields / Modules
 * For original code / licensing please refer to
 * http://www.smokeandwires.co.nz
 *
 */
#include "main.h"
#include <stdlib.h>
#include <stdarg.h>
#include <stdio.h>
#include "st7783.h"
#include "stm32f0xx_hal.h"
#include "glcdfont.h"
#include "stm32f070xb.h"
#include "BML_DRIVER.h"

#define TFTWIDTH   240
#define TFTHEIGHT  320

#define TFTLCD_DELAY 0xFF

// GPIO to data bus pin connections
// ---- PORT Pin ---     --- Data ----
// GPIOA, GPIO_PIN_9  -> BIT 0
// GPIOC, GPIO_PIN_7  -> BIT 1
// GPIOA, GPIO_PIN_10 -> BIT 2
// GPIOB, GPIO_PIN_3  -> BIT 3
// GPIOB, GPIO_PIN_5  -> BIT 4
// GPIOB, GPIO_PIN_4  -> BIT 5
// GPIOB, GPIO_PIN_10 -> BIT 6
// GPIOA, GPIO_PIN_8  -> BIT 7

#define LCD_CS_PIN  GPIO_PIN_0	// PB0 -> A3 // Chip Select goes to Analog 3
#define LCD_CD_PIN  GPIO_PIN_4	// PA4 -> A2 // Command/Data goes to Analog 2
#define LCD_WR_PIN  GPIO_PIN_1	// PA1 -> A1 // LCD Write goes to Analog 1
#define LCD_RD_PIN  GPIO_PIN_0	// PA0 -> A0 // LCD Read goes to Analog 0
#define LCD_RST_PIN GPIO_PIN_1	// PC1 -> RESET

#define LCD_CS_GPIO_PORT  GPIOB
//#define LCD_CS_HIGH()     LCD_CS_GPIO_PORT->BSRR = (1 << LCD_CS_PIN)
//#define LCD_CS_LOW()      LCD_CS_GPIO_PORT->BSRR = (1 << (LCD_CS_PIN + 16))
#define LCD_CS_HIGH()     gpio_write(LCD_CS_GPIO_PORT, 0, HIGH)
#define LCD_CS_LOW()      gpio_write(LCD_CS_GPIO_PORT, 0, LOW)

#define LCD_RD_GPIO_PORT  GPIOA
//#define LCD_RD_HIGH()     LCD_RD_GPIO_PORT->BSRR = (1 << LCD_RD_PIN)
//#define LCD_RD_LOW()      LCD_RD_GPIO_PORT->BSRR = (1 << (LCD_RD_PIN + 16))
#define LCD_RD_HIGH()      gpio_write(LCD_RD_GPIO_PORT, 0, HIGH)
#define LCD_RD_LOW()       gpio_write(LCD_RD_GPIO_PORT, 0, LOW)

#define LCD_WR_GPIO_PORT  GPIOA
//#define LCD_WR_HIGH()	  LCD_WR_GPIO_PORT->BSRR = (1 << LCD_WR_PIN)
//#define LCD_WR_LOW()      LCD_WR_GPIO_PORT->BSRR = (1 << (LCD_WR_PIN + 16))
#define LCD_WR_HIGH()	   gpio_write(LCD_WR_GPIO_PORT, 1, HIGH)
#define LCD_WR_LOW()       gpio_write(LCD_WR_GPIO_PORT, 1, LOW)

#define LCD_CD_GPIO_PORT  GPIOA
//#define LCD_CD_HIGH()     LCD_CD_GPIO_PORT->BSRR = (1 << LCD_CD_PIN)
//#define LCD_CD_LOW()      LCD_CD_GPIO_PORT->BSRR = (1 << (4 + 16))
#define LCD_CD_HIGH()      gpio_write(LCD_CD_GPIO_PORT, 4, HIGH)
#define LCD_CD_LOW()       gpio_write(LCD_CD_GPIO_PORT, 4, LOW)

#define LCD_RST_GPIO_PORT GPIOC
//#define LCD_RST_HIGH()    LCD_RST_GPIO_PORT->BSRR = (1 << LCD_RST_PIN)
//#define LCD_RST_LOW()     LCD_RST_GPIO_PORT->BSRR = (1 << (LCD_RST_PIN + 16))
#define LCD_RST_HIGH()     gpio_write(LCD_RST_GPIO_PORT, 1, HIGH)
#define LCD_RST_LOW()      gpio_write(LCD_RST_GPIO_PORT, 1, LOW)

#define LCD_WR_STROBE() { LCD_WR_LOW(); delay(1); LCD_WR_HIGH(); delay(1); }

#define swap(a, b) { int16_t t = a; a = b; b = t; }

static int16_t m_width;
static int16_t m_height;
static int16_t m_cursor_x;
static int16_t m_cursor_y;

static uint16_t m_textcolor;
static uint16_t m_textbgcolor;
static uint8_t m_textsize;
static uint8_t m_rotation;
static uint8_t m_wrap;

// Initialization commands
static const uint16_t ST7781_regValues[] = { 0x0001, 0x0100, 0x0002, 0x0700,
		0x0003, 0x1030, 0x0008, 0x0302, 0x0009, 0x0000, 0x000A, 0x0008,
		//*******POWER CONTROL REGISTER INITIAL*******//
		0x0010, 0x0790, 0x0011, 0x0005, 0x0012, 0x0000, 0x0013, 0x0000,
		//delayms(50,
		//********POWER SUPPPLY STARTUP 1 SETTING*******//
		0x0010, 0x12B0,
		// delayms(50,
		0x0011, 0x0007,
		//delayms(50,
		//********POWER SUPPLY STARTUP 2 SETTING******//
		0x0012, 0x008C, 0x0013, 0x1700, 0x0029, 0x0022,
		// delayms(50,
		//******GAMMA CLUSTER SETTING******//
		0x0030, 0x0000, 0x0031, 0x0505, 0x0032, 0x0205, 0x0035, 0x0206, 0x0036,
		0x0408, 0x0037, 0x0000, 0x0038, 0x0504, 0x0039, 0x0206, 0x003C, 0x0206,
		0x003D, 0x0408,
		// -----------DISPLAY WINDOWS 240*320-------------//
		0x0050, 0x0000, 0x0051, 0x00EF, 0x0052, 0x0000, 0x0053, 0x013F,
		//-----FRAME RATE SETTING-------//
		0x0060, 0xA700, 0x0061, 0x0001, 0x0090,
		0x0033, //RTNI setting
		//-------DISPLAY ON------//
		0x0007, 0x0133, 0x0001, 0x0100, 0x0002, 0x0700, 0x0003, 0x1030, 0x0008,
		0x0302, 0x0009, 0x0000, 0x000A, 0x0008,
		//*******POWER CONTROL REGISTER INITIAL*******//
		0x0010, 0x0790, 0x0011, 0x0005, 0x0012, 0x0000, 0x0013, 0x0000,
		//delayms(50,
		//********POWER SUPPPLY STARTUP 1 SETTING*******//
		0x0010, 0x12B0,
		// delayms(50,
		0x0011, 0x0007,
		// delayms(50,
		//********POWER SUPPLY STARTUP 2 SETTING******//
		0x0012, 0x008C, 0x0013, 0x1700, 0x0029, 0x0022,
		// delayms(50,
		//******GAMMA CLUSTER SETTING******//
		0x0030, 0x0000, 0x0031, 0x0505, 0x0032, 0x0205, 0x0035, 0x0206, 0x0036,
		0x0408, 0x0037, 0x0000, 0x0038, 0x0504, 0x0039, 0x0206, 0x003C, 0x0206,
		0x003D, 0x0408,
		// -----------DISPLAY WINDOWS 240*320-------------//
		0x0050, 0x0000, 0x0051, 0x00EF, 0x0052, 0x0000, 0x0053, 0x013F,
		//-----FRAME RATE SETTING-------//
		0x0060, 0xA700, 0x0061, 0x0001, 0x0090, 0x0033, //RTNI setting
		//-------DISPLAY ON------//
		0x0007, 0x0133, };

void delay(unsigned int t) {
	for (; t > 0; t--) {
		__asm("nop");
	}
}

/**
 * \brief GPIO Initialization
 * 
 * \param 
 * 
 * \return void
 */
static void GPIO_Init(void) {
	GPIO_InitTypeDef GPIO_InitStruct;

	/* GPIO Ports Clock Enable */
	__GPIOC_CLK_ENABLE()
	;
	__GPIOA_CLK_ENABLE()
	;
	__GPIOB_CLK_ENABLE()
	;

	/*Configure GPIO pins : PC1 PC7 */
	GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_7;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	gpio_config(PORTC, 1, OUTPUT_MODE, HIGH_SPEED, DI_PUPD, PHPL);
	gpio_config(PORTC, 7, OUTPUT_MODE, HIGH_SPEED, DI_PUPD, PHPL);

	/*Configure GPIO pins : PA0 PA2 PA5 PA8
	 PA9 PA10 */
	GPIO_InitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_8 | GPIO_PIN_9
			| GPIO_PIN_10 | GPIO_PIN_1 | GPIO_PIN_4;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

//	gpio_config(PORTA, 0, OUTPUT_MODE, HIGH_SPEED, DI_PUPD, PHPL);
//	gpio_config(PORTA, 2, OUTPUT_MODE, HIGH_SPEED, DI_PUPD, PHPL);
//	gpio_config(PORTA, 5, OUTPUT_MODE, HIGH_SPEED, DI_PUPD, PHPL);
//	gpio_config(PORTA, 8, OUTPUT_MODE, HIGH_SPEED, DI_PUPD, PHPL);
//	gpio_config(PORTA, 9, OUTPUT_MODE, HIGH_SPEED, DI_PUPD, PHPL);
//	gpio_config(PORTA, 10, OUTPUT_MODE, HIGH_SPEED, DI_PUPD, PHPL);

	/*Configure GPIO pins : PB0 PB10 PB4 PB5 */
	GPIO_InitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_3 | GPIO_PIN_10 | GPIO_PIN_4
			| GPIO_PIN_5;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

